rottenpotatoes/app/controllers/movies_controller.rb

  def find_same_director
    @movie = Movie.find(params[:id])
    if @movie.director == nil or @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "James Cameron"]]

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "director", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Aladdin Director"], ["updated_at", "2018-10-04 14:54:26.983851"], ["id", 1]]

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 13]]